{
  "scenes": [
    {
      "id": "wakeup",
      "text": "You wake up in your house dormitory, the sun streaming through the window. It's your first morning at Hogwarts.",
      "choices": [
        { "text": "Go to the common room", "next": "common_room" },
        { "text": "Make friends with a dormmate", "next": "make_friends", "setFlag": "madeFriend" },
        { "text": "Stay in bed a bit longer", "next": "sleep_in" }
      ]
    },
    {
      "id": "make_friends",
      "text": "You strike up a conversation with a fellow first year. You feel a little less nervous about the day ahead.",
      "choices": [
        { "text": "Go to the common room", "next": "common_room" }
      ]
    },
    {
      "id": "sleep_in",
      "text": "You pull the covers over your head and try to snooze a bit more. Eventually, you hear voices from the common room.",
      "choices": [
        { "text": "Go to the common room", "next": "common_room" }
      ]
    },
    {
      "id": "common_room",
      "text": "Your head of house is waiting in the common room, holding a stack of timetables. 'Good morning! Here are your schedules for the year.'",
      "choices": [
        { "text": "Thank your head of house", "next": "after_timetable", "action": "unlockSchool" }
      ],
      "setFlag": "hasTimetable"
    },
    {
      "id": "after_timetable",
      "text": "Timetable in hand, you consider your next move.",
      "choices": [
        { "text": "Go to breakfast in the Great Hall", "next": "breakfast", "setFlag": "ateBreakfast" },
        { "text": "Skip breakfast and go straight to class", "next": "goto_school" }
      ]
    },
    {
      "id": "breakfast",
      "text": "You enjoy a hearty breakfast and chat with some classmates. Peeves the poltergeist is gesturing to you to go talk to him away from your table.",
      "choices": [
        { "text": "Go to class", "next": "goto_school" },
        { "text": "Talk to Peeves.", "next": "talkto_peeves" }
      ]
    },
    {
      "id": "talkto_peeves",
      "text": "Peeves tells you he is looking for some mischief makers to join his secret club.",
      "choices": [
        { "text": "Join the Peeves Pests.", "next": "peeves_pests", "action": "unlockPeevesPests", "setFlag": "peevesPest" },
        { "text": "Politely decline and go to class.", "next": "goto_school" }
      ]
    },
    {
      "id": "peeves_pests",
      "text": "You are now a proud member of the Peeves Pests! Peeves grins, 'I'll be in touch with your first mayhemous mission soon...'",
      "choices": [
        { "text": "Go to class", "next": "goto_school" }
      ]
    },
    {
      "id": "goto_school",
      "text": "You head off to your first class, ready for a magical day.",
      "choices": [
        { "text": "Go to the School Page", "next": "END", "action": "gotoSchool" },
        { "text": "End of term feast...", "next": "troll_intro", "requiredSpell": "Wingardium Leviosa" }
      ]
    },
    { "id": "troll_intro",
  "text": "Your first term at Hogwarts has gone well; you've learned a few spells and made a few friends along the way. You sit in the Great Hall at the end of term feast with your friends at the {character.house} table when Professor Quirrell bursts into the hall, wild-eyed and stammering, 'Troll - there's a troll - in the dungeons! Thought you ought to know.' He then collapses in a heap. Professor Dumbledore leaps to his feet, shouting over the crowd and sending students back to their dorms. But as you follow the crowd, you overhear a rumour: a girl has been crying in the bathroom all afternoon. She won't know about the troll. You could tell a teacher... but you know magic and the troll is in the dungeons, not the bathroom. Without a moments hesitation, you slip away and race down to the bathroom...",
"choices": [
  { "text": "Continue", "next": "troll_bathroom" }
]
},
{
  "id": "troll_bathroom",
  "text": "You arrive just in time to see the massive troll lumbering in, swinging its club. The girl shrieks and hides behind a row of sinks. The troll turns toward you, nostrils flaring. What do you do?",
  "choices": [
    { "text": "Throw something at the troll to distract it", "next": "troll_throw" },
    { "text": "Jump on its back!", "next": "troll_jump" },
    { "text": "Use Wingardium Leviosa to lift its club", "next": "troll_leviosa" }
  ]
},
{
  "id": "troll_throw",
  "text": "You grab the nearest object, a piece of sink that has been smashed off, and throw with all your might at the trolls head. Roll 1D12+courage to see how bravely you act.",
  "choices": [
    { "text": "Roll for Courage", "next": "troll_throw_result" }
  ]
},
{
  "id": "troll_throw_result",
  "text": "You let fly with all your might...",
   "choices": [
    { "text": "Roll",
    "roll": { "stat": "courage", "target": 10, "sucess": "troll_throw_success", "fail": "troll_throw_fail" }
   }
  ]
},
{
  "id": "troll_throw_success",
  "text": "Your aim is true, the porcelain flies through the air and hits the troll right on the bridge of the nose. It bellows with pain and turns its back, giving you an opening.",
  "choices": [
    { "text": "Jump on its back!", "next": "troll_jump" },
    { "text": "Wingardium Leviosa", "next": "troll_leviosa" }
  ]
},
{
  "id": "troll_throw_fail",
  "text": "The porcelain bounces harmlessly off the trolls thick hide. Now it's angry! The troll charges towards you",
  "choices": [
    { "text": "Dodge out of the way", "next": "troll_dodge" }
  ]
},
{
  "id": "troll_dodge",
  "text": "You try to dodge the troll's massive fist. Roll 1D12+Agility.",
  "choices": [
    { "text": "Roll for agility", "next": "troll_dodge_result" }
  ]
},
{
  "id": "troll_dodge_result",
  "text": "the troll swings its fist...",
  "choices": [
    { "text": "Roll",
    "roll": { "stat": "agility", "target": 10, "success": "troll_dodge_success", "fail": "troll_dodge_fail" }
    }
  ]
},
{
  "id": "troll_dodge_success",
  "text": "You dive aside, just in time! The troll stumbles forward, dazed.",
  "choices": [
    { "text": "Wingardium Leviosa", "next": "troll_leviosa" }
  ]
},
{
  "id": "troll_dodge_fail",
  "text": "The troll catches you with its fist, sending you sprawling. Stars dance before your eyes. It raises its club, high above its head ready to strike. You grasp your wand, 'swish and flick' the mousey haired girl under the sink mouths to you",
"choices": [
  { "text": "Wingardium Leviosa", "next": "troll_leviosa" }
]
},
{
  "id": "troll_jump",
  "text": "You run at the troll and leap onto its back! Roll 1D12+Knowledge to recall how best to distract it from here",
  "choices": [
    { "text": "Roll for Knowledge", "next": "troll_jump_result" }
  ]
},
{
  "id": "troll_jump_result",
  "text": "You desperately try to remember something useful...",
  "choices": [
    { "text": "Roll", 
    "roll": { "stat": "knowledge", "target": 10, "success": "troll_jump_success", "fail": "troll_jump_fail" }
    }
  ]
},
{
  "id": "troll_jump_success",
  "text": "You remember: trolls are easily confused! You grab its ear and yell into it at the top of your lungs. The troll spins round, confused, and gets dizzy",
  "choices": [
    { "text": "Wingardium Leviosa", "next": "troll_leviosa" }
  ]
},
{
  "id": "troll_jump_fail",
  "text": "You freeze, unable to think of anything clever. The troll shrugs you off, you grab your wand as it aims up to strike...",
  "choices": [
    { "text": "Wingardium Leviosa", "next": "troll_leviosa" }
  ]
},
{
  "id": "troll_leviosa",
  "text": "You point your wand at the trolls club, swish and flick and shout 'WINGARDIUM LEVIOSA!' Roll 1D12+Magic.",
  "choices": [
    { "text": "Roll for Magic", "next": "troll_leviosa_result" }
  ]
},
{
  "id": "troll_leviosa_result",
  "text": "Your spell hits the club, just as the troll swings downward...",
  "choices": [
    { "text": "Roll",
    "roll": { "stat": "magic", "target": 10, "success": "troll_leviosa_success", "fail": "troll_leviosa_fail" }
    }
  ]
},
{
  "id": "troll_leviosa_success",
  "text": "The club soars out of the trolls hand and it swings an empty fist through the air. The club lingers for a moment then falls 'BONK' right on top of its head! The troll collapses, unconscious. The girl peeks out, wide-eyed and grateful. Just then Professors McGonagall, Snape, and Quirrell burst into the bathroom. McGonagall looks at you over her spectacles, astonished. 'not many first years could take on a troll and live to tell the tale, ten points... will be awarded to {character.house}, for sheer dumb luck...'",
  "choices": [
    { "text": "Help the girl up and return to your dormitory", "next": "troll_epilogue", "setFlag": "defeatedTroll", "awardExperience": 10 }
  ]
},
{
  "id": "troll_leviosa_fail",
  "text": "Your spell fizzles! The troll howls and swings its club, narrowly missing you as you sprint out of the bathroom, straight into the path of Professors McGonagall, Snape, and Quirrell. The professors dart into the bathroom and disarm the troll in one swift moment. They turn to you in the hallway. 'That was incredibly dangerous and foolish, five points will be taken from {character.house}. Now return to your dormitory'",
  "choices": [
    { "text": "You limp back to your dormitory, sore, tired, but at least you survived.", "next": "troll_epilogue", "setFlag": "trollSurvivor", "awardExperience": -5 }
  ]
},
{
  "id": "troll_epilogue",
  "text": "The story of how you took on a troll spreads throughout the school, some call you dumb, others call you a hero, but nobody talks of anything else. At least not for a while",
  "choices": [
    { "text": "Continue", "next": "term_two" }
  ]
},
{
  "id": "term_two",
  "text": "The school is still buzzing with rumours about what happened in that bathroom, but only you know the truth. You go into your second term at Hogwarts ready to learn.",
  "choices": [
    { "text": "Go to class", "next": "goto_school" }
  ]
}
  ]
}
